#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖``
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

data.aws_vpc.vpc: Reading...
data.aws_security_group.security_group: Reading...
data.aws_security_group.security_group: Read complete after 0s [id=sg-0e50f133f17baacc3]
data.aws_vpc.vpc: Read complete after 1s [id=vpc-00f5f0e1d79134868]
data.aws_subnets.subnets: Reading...
data.aws_subnets.subnets: Read complete after 0s [id=us-east-1]
aws_db_instance.rds_postgresql: Refreshing state... [id=db-2SHT2AY5AR365O2L3ZQNFW6UZM]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_db_instance.rds_postgresql will be created
  + resource "aws_db_instance" "rds_postgresql" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 7
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = "fiap_tech_challenge"
      + db_subnet_group_name                  = "rds-subnet-group"
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = "16.3"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "rds-postgresql"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + max_allocated_storage                 = 25
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = "default.postgres16"
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = true
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags                                  = {
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "fiap-tech-challenge-db-infra"
          + "Repository"  = "https://github.com/rafabernardo/fiap-tech-challenge-db-infra"
        }
      + tags_all                              = {
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "fiap-tech-challenge-db-infra"
          + "Repository"  = "https://github.com/rafabernardo/fiap-tech-challenge-db-infra"
        }
      + timezone                              = (known after apply)
      + username                              = "user_fiap"
      + vpc_security_group_ids                = [
          + "sg-0e50f133f17baacc3",
        ]

      + timeouts {
          + create = "15m"
          + delete = "15m"
          + update = "15m"
        }
    }

  # aws_db_subnet_group.rds_subnet_group will be created
  + resource "aws_db_subnet_group" "rds_subnet_group" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "rds-subnet-group"
      + name_prefix             = (known after apply)
      + subnet_ids              = [
          + "subnet-0287f396bd4ea2cd4",
          + "subnet-02c13fe6eff28a48d",
          + "subnet-04e4f724dfc4ee4b5",
          + "subnet-0863a64f28eaa6110",
          + "subnet-0e0c9b208a1acef9c",
          + "subnet-0ee9a5fb5f6dab9f4",
        ]
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Name" = "rds-subnet-group"
        }
      + tags_all                = {
          + "Name" = "rds-subnet-group"
        }
      + vpc_id                  = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  - endpoint          = "rds-postgresql.c28pigc4sgl3.us-east-1.rds.amazonaws.com:5432" -> null
  - name              = "fiap_tech_challenge" -> null
  - security_group_id = "sg-076eaeec13d1a4416" -> null

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>
*Pushed by: @rafabernardo, Action: `pull_request`*